// src/config/faqLocal.ts

export const faqLocalData: Record<
  string,
  {
    response?: string;
    buttons?: { label: string; action: string; link?: string }[];
  }
> = {
  "กลับหน้าเริ่มต้น": {
      
      "response": "ไรโน่ยินดีให้คำปรึกษาครับ กรุณาเลือกหัวข้อที่ต้องการให้ช่วยเหลือได้เลยครับ",
      "buttons": [
        { "label": "คุยกับ GS Chat bot", "action": "คุยกับ GS Chat bot" },
        { "label": "เกี่ยวกับแบตเตอรี่", "action": "เกี่ยวกับแบตเตอรี่" },
        { "label": "การเคลมแบตเตอรี่", "action": "การเคลมแบตเตอรี่" }
      ]
    },
    "คุยกับ GS Chat bot": {
      
      "buttons": [
        { "label": "สมัครตัวแทนจำหน่าย", "action": "สมัครตัวแทนจำหน่าย" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "สมัครตัวแทนจำหน่าย": {
      
      "response": "ไรโน่ขอขอบคุณที่สนใจเป็นครอบครัวยีเอสนะครับ คุณลูกค้าต้องการสั่งซื้อเท่าใดครับ",
      "buttons": [
        { "label": "สนใจสั่งซื้อมากกว่า 200 ลูก/เดือน", "action": "สนใจสั่งซื้อมากกว่า 200 ลูก/เดือน" },
        { "label": "สนใจสั่งซื้อน้อยกว่า 200 ลูก/เดือน", "action": "สนใจสั่งซื้อน้อยกว่า 200 ลูก/เดือน" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "สนใจสั่งซื้อมากกว่า 200 ลูก/เดือน": {
      
      "response": "กรณีที่สนใจเป็นตัวแทนจัดจำหน่ายกับทางบริษัทฯ ต้องมียอดขั้นต่ำในการสั่งซื้อที่ 200 ลูก/เดือนครับ ทั้งนี้ ขออนุญาตพิจารณาเงื่อนไขอื่นๆ ประกอบด้วย หากสนใจรบกวนกรอกข้อมูลเพื่อให้เจ้าหน้าที่ฝ่ายขายติดต่อกลับครับผม",
      "buttons": [
        { "label": "ติดต่อฝ่ายขาย", "action": "ติดต่อฝ่ายขาย", "link": "https://gsbattery.co.th/th/contact_us" },
        { "label": "ติดต่อเจ้าหน้าที่", "action": "ติดต่อเจ้าหน้าที่", "link": "tel:0-2726-8070" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "ติดต่อฝ่ายขาย": {
      
      "buttons": [
        { "label": "ติดต่อฝ่ายขาย", "action": "ติดต่อฝ่ายขาย", "link": "https://gsbattery.co.th/th/contact_us" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },

    "ติดต่อเจ้าหน้าที่": {
      
      "response": "ติดต่อเจ้าหน้ากดเบอร์ 0-2726-8070"
    },

    "สนใจสั่งซื้อน้อยกว่า 200 ลูก/เดือน": {
      
      "response": "ขออนุญาตแนะนำตัวแทนจำหน่ายยีเอสในพื้นที่ให้นะครับ",
      "buttons": [
        { "label": "ค้นหาร้านค้าแบตเตอรี่", "action": "ค้นหาร้านค้าแบตเตอรี่", "link": "https://gsbattery.co.th/th/findstore" },
        { "label": "ติดต่อเจ้าหน้าที่", "action": "ติดต่อเจ้าหน้าที่", "link": "tel:0-2726-8070" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
  
    "เกี่ยวกับแบตเตอรี่": {
      
      "response": "ไรโน่ยินดีให้บริการครับ คุณลูกค้าสามารถเลือกเรื่องที่ต้องการสอบถามได้เลยครับ",
      "buttons": [
        { "label": "คุณสมบัติของแบตเตอรี่แต่ละประเภท", "action": "คุณสมบัติของแบตเตอรี่" },
        { "label": "สอบถามราคาแบตเตอรี่", "action": "สอบถามราคาแบตเตอรี่" },
        { "label": "วิธีดูเดือนที่ผลิตแบตเตอรี่", "action": "วิธีดูเดือนที่ผลิตแบตเตอรี่" },
        { "label": "ค่า CCA และแอมป์ของแบตเตอรี่", "action": "ค่า CCA และแอมป์ของแบตเตอรี่" },
        { "label": "วิธีดูตาแมวแบตเตอรี่", "action": "วิธีดูตาแมวแบตเตอรี่" },
        { "label": "หลักการทำงานของแบตเตอรี่", "action": "หลักการทำงานของแบตเตอรี่" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "คุณสมบัติของแบตเตอรี่": {
      
      "response": "คุณลูกค้าสามารถเลือกประเภทแบตเตอรี่ที่ต้องการสอบถามได้เลยครับ",
      "buttons": [
        { "label": "Maintenance Free : ประเภทแบตเตอรี่พร้อมใช้", "action": "Maintenance Free : ประเภทแบตเตอรี่พร้อมใช้" },
        { "label": "Hybrid : ประเภทแบตเตอรี่ไฮบริด", "action": "Hybrid : ประเภทแบตเตอรี่ไฮบริด" },
        { "label": "Conventional : ประเภทแบตเตอรี่ชนิดเติมน้ำกลั่น", "action": "Conventional : ประเภทแบตเตอรี่ชนิดเติมน้ำกลั่น" },
        { "label": "EFB : ประเภทแบตเตอรี่ Start-Stop System", "action": "EFB : ประเภทแบตเตอรี่ Start-Stop System" },
        { "label": "DIN type : ประเภทแบตเตอรี่ขั้วจม", "action": "DIN type : ประเภทแบตเตอรี่ขั้วจม" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    
    "Maintenance Free":{
      
      "response": "ประเภทแบตเตอรี่พร้อมใช้\n1.ไม่ต้องดูแลน้ำกลั่นตลอดอายุการใช้งาน*\n2.พร้อมใช้งานได้ทันที\n3.กำลังไฟสตาร์ทสูง\n(*การดูแลน้ำกลั่นขึ้นอยู่กับสภาพการใช้งานรถยนต์)"
    },
    "Hybrid":{
      
      "response": "ประเภทแบตเตอรี่ไฮบริด\n1.ไม่ต้องดูแลน้ำกลั่นตลอดอายุการใช้งาน*\n2.พร้อมใช้งานได้ทันที\n3.กำลังไฟสตาร์ทสูง\n(*การดูแลน้ำกลั่นขึ้นอยู่กับสภาพการใช้งานรถยนต์)"
    },
    "Conventional":{
      
      "response": "ประเภทแบตเตอรี่ชนิดเติมน้ำกลั่น\n1.ทนทานต่อความร้อนจากเครื่องยนต์ได้ดี\n2.กรณีใช้งานปกติ ควรดูแลระดับน้ำกลั่นเดือนละ 1 ครั้ง\n3.กรณีใช้งานหนัก ควรดูแลระดับน้ำกลั่นทุก 15 วัน"
    },
    "EFB":{
      
      "response": "ประเภทแบตเตอรี่ Start-Stop Systemn\n1.จำนวนแผ่นธาตุมาก\n2.กำลังไฟสูงเพิ่มประสิทธิภาพ\n3.ชาร์จไฟได้ไวขึ้นและปล่อยกำลังไฟได้ดี\n4.สเป็คตรงรุ่นยืดอายุการใช้งาน\n5.ไม่ต้องดูแลตลอดอายุการใช้งาน*\n(*การดูแลน้ำกลั่นขึ้นอยู่กับสภาพการใช้งานรถยนต์)"
    },
    "DIN type":{
      
      "response": "ประเภทแบตเตอรี่ขั้วจม DIN\n1.ไม่ต้องดูแลน้ำกลั่นตลอดอายุการใช้งาน*\n2.สเป็คตรงรุ่นยืดอายุการใช้งาน\n3.กำลังไฟสตาร์ทสูงเพิ่มประสิทธิภาพ\n(*การดูแลน้ำกลั่นขึ้นอยู่กับสภาพการใช้งานรถยนต์)"
    },
    
    "สอบถามราคาแบตเตอรี่": {
      
      "response": "คุณลูกค้าสามารถสอบถามราคาจากร้านแบตเตอรี่ใกล้บ้าน หรือกด GS Prompt 1380 ได้เลยครับ",
      "buttons": [
        { "label": "GS PROMPT 1380", "action": "GS PROMPT 1380", "link": "tel:1380" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "แบตเตอรี่ประเภทเติมน้ำชาร์จไฟจากโรงงาน": {
      
      "response": "สำหรับเดือนที่ผลิตและชาร์จสามารถดูได้จากข้างกล่องแบตเตอรี่  โดยแบตเตอรี่ประเภทเติมน้ำชาร์จไฟจากโรงงาน “ระบุเดือนที่ชาร์จ”  "
    },
    "แบตเตอรี่ประเภทยังไม่เติมน้ำชาร์จไฟจากโรงงาน": {
      
      "response": "สามารถดูได้จากข้างกล่องแบตเตอรี่   โดยแบตเตอรี่ประเภทยังไม่เติมน้ำชาร์จไฟ “ระบุเดือนที่ผลิต” "
    },

    "วิธีดูเดือนที่ผลิตแบตเตอรี่": {
      
      "response": "คุณลูกค้าสามารถเลือกหัวข้อที่ต้องการทราบได้เลยครับ",
      "buttons": [
        { "label": "แบตเตอรี่ประเภทเติมน้ำชาร์จไฟจากโรงงาน", "action": "แบตเตอรี่ประเภทเติมน้ำชาร์จไฟจากโรงงาน" },
        { "label": "แบตเตอรี่ประเภทยังไม่เติมน้ำชาร์จไฟจากโรงงาน", "action": "แบตเตอรี่ประเภทยังไม่เติมน้ำชาร์จไฟจากโรงงาน" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    
  
    "ค่า CCA และแอมป์ของแบตเตอรี่": {
      
      "response": "คุณลูกค้าสามารถเลือกหัวข้อที่ต้องการทราบได้เลยครับ",
      "buttons": [
        { "label": "ค่า CCA ของยีเอสทดสอบจากอะไร", "action": "ค่า CCA ของยีเอสทดสอบจากอะไร" },
        { "label": "แอมป์และCCA ของแบตเตอรี่แต่ละรุ่น", "action": "แอมป์และCCA ของแบตเตอรี่แต่ละรุ่น" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "ค่า CCA ของยีเอสทดสอบจากอะไร": {
      
      "response": "ยีเอสแบตเตอรี่ทดสอบในอุณหภูมิในห้องปฏิบัติการที่ใช้เป็นตัวกำหนดมาตรฐานการวัดค่า CCA ตามมาตรฐานของ IEC คือ -18°C  ซึ่งค่าที่วัดได้นี้จะลดน้อยถอยลงตามสภาพแบตเตอรี่  ดังนั้นค่า CCA อย่างเดียวจึงไม่อาจระบุได้ว่าแบตเตอรี่มีปัญหาหรือไม่ครับ"
    },
    "แอมป์และCCA ของแบตเตอรี่แต่ละรุ่น": {
      
      "buttons": [
        { "label": "แบตเตอรรี่ชนิดไม่ต้องเติมน้ำกลั่น", "action": "แบตเตอรรี่ชนิดไม่ต้องเติมน้ำกลั่น", "link": "https://gsbattery.co.th/th/productByType/1/MF" },
        { "label": "แบตเตอรี่ชนิดเติมน้ำกลั่น", "action": "แบตเตอรี่ชนิดเติมน้ำกลั่น", "link": "https://gsbattery.co.th/th/productByType/3/CV" },
        { "label": "แบตเตอรี่ไฮบริด", "action": "แบตเตอรี่ไฮบริด", "link": "https://gsbattery.co.th/th/productByType/2/HB" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "แบตเตอรรี่ชนิดไม่ต้องเติมน้ำกลั่น": {
      
      "response": "แบตเตอรรี่ชนิดไม่ต้องเติมน้ำกลั่น",
      "buttons": [
        { "label": "แบตเตอรรี่ชนิดไม่ต้องเติมน้ำกลั่น", "action": "แบตเตอรรี่ชนิดไม่ต้องเติมน้ำกลั่น", "link": "https://gsbattery.co.th/th/productByType/1/MF" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "แบตเตอรี่ชนิดเติมน้ำกลั่น": {
      
      "response": "แบตเตอรี่ชนิดเติมน้ำกลั่น",
      "buttons": [
        { "label": "แบตเตอรี่ชนิดเติมน้ำกลั่น", "action": "แบตเตอรี่ชนิดเติมน้ำกลั่น", "link": "https://gsbattery.co.th/th/productByType/3/CV" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "แบตเตอรี่ไฮบริด": {
      
      "response": "แบตเตอรี่ไฮบริด",
      "buttons": [
        { "label": "แบตเตอรี่ไฮบริด", "action": "แบตเตอรี่ไฮบริด", "link": "https://gsbattery.co.th/th/productByType/2/HB" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
  
    "วิธีดูตาแมวแบตเตอรี่": {
      
      "response": "ตาแมวของแบตเตอรี่เป็นการแสดงสถานะแบตเตอรี่ที่มีปัญหาเพียงช่องเดียวเท่านั้น ดังนั้นคุณลูกค้าสามารถเลือกตัวอย่างสถานะตาแมวได้ดังนี้ครับ",
      "buttons": [
        { "label": "ไฟเต็ม", "action": "ไฟเต็ม" },
        { "label": "ไฟอ่อน", "action": "ไฟอ่อน" },
        { "label": "น้ำกลั่นแห้ง", "action": "น้ำกลั่นแห้ง" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "ไฟเต็ม": {
      
      "response": "ตาแมวแบตเตอรี่สีเขียวแสดงว่าแบตเตอรี่มีสภาพดีและมีการชาร์จไฟเต็ม"
    },
    "ไฟอ่อน": {
      
      "response": "ตาแมวแบตเตอรี่สีดำแสดงว่าแบตเตอรี่มีสภาพไม่ดีและต้องการการชาร์จไฟ"
    },
    "น้ำกลั่นแห้ง": {
      
      "response": "ตาแมวแบตเตอรี่สีขาวแสดงว่าแบตเตอรี่มีน้ำกลั่นแห้งและต้องเติมน้ำกลั่น"
    },
  
    "หลักการทำงานของแบตเตอรี่": {
      
      "response": "หลักการทำงานของแบตเตอรี่คือการเปลี่ยนพลังงานเคมีให้เป็นพลังงานไฟฟ้า เพื่อให้สามารถใช้งานในระบบไฟฟ้าได้",
      "buttons": [
        { "label": "หลักการทำงานของไดชาร์จ", "action": "หลักการทำงานของไดชาร์จ" },
        { "label": "ค่ากระแสไฟรั่วในรถยนต์", "action": "ค่ากระแสไฟรั่วในรถยนต์" },
        { "label": "ค่าความถ่วงจำเพาะ  (ถพ.) ของความเข้มข้นน้ำกรด", "action": "ค่าความถ่วงจำเพาะ  (ถพ.) ของความเข้มข้นน้ำกรด" },
        { "label": "ระดับน้ำกรดที่เหมาะสมของแบตเตอรี่", "action": "ระดับน้ำกรดที่เหมาะสมของแบตเตอรี่" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
  
    "หลักการทำงานของไดชาร์จ": {
      
      "response": "โวลต์ไดชาร์จรถยนต์ทำงานปกติควรอยู่ที่ 13.6 - 14.5 โวลต์ ขณะเปิดและปิดการใช้งานของอุปกรณ์ไฟฟ้าในรถยนต์"
    },
    "ค่ากระแสไฟรั่วในรถยนต์": {
      
      "response": "กระแสไฟรั่วของรถยนต์ขณะจอดนิ่งไม่ได้สตาร์ทเครื่องยนต์ไม่ควรมีค่าเกิน 1 แอมป์ (Amp)"
    },
    "ค่าความถ่วงจำเพาะ  (ถพ.) ของความเข้มข้นน้ำกรด": {
      
      "response": "สำหรับแบตเตอรี่ Conventional และ Dry Hybrid ควรมีค่า ถพ. อยู่ที่ 1.26 และแบตเตอรี่ Wet Hybrid และ  Maintenance Free ควรมีค่า ถพ.อยู่ที่ 1.28"
    },
    "ระดับน้ำกรดที่เหมาะสมของแบตเตอรี่": {
      
      "response": "ควรเติมน้ำกลั่นและรักษาให้อยู่ระหว่างเส้น Upper - Lower ของแบตเตอรี่ในทุกๆ ช่องครับ"
    },
    "วิธีส่งเคลมแบตเตอรี่": {
      
      "response": "คุณลูกค้าซื้อแบตเตอรี่จากพื้นที่ใด สามารถเลือกจากหัวข้อที่ระบุ  (ในพื้นที่หมายถึงใกล้บ้านหรือในจังหวัดที่อาศัย ส่วนนอกพื้นที่คือไกลบ้านหรือนอกจังหวัดที่อาศัย)",
      "buttons": [
        { "label": "ซื้อในพื้นที่", "action": "ซื้อในพื้นที่" },
        { "label": "ซื้อนอกพื้นที่", "action": "ซื้อนอกพื้นที่" },
        { "label": "ซื้อจากยีเอสพร้อม", "action": "ซื้อจากยีเอสพร้อม" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "การเคลมแบตเตอรี่": {
      
      "response": "คุณลูกค้าสามารถเลือกหัวข้อที่ต้องการทราบได้เลยครับ",
      "buttons": [
        { "label": "วิธีส่งเคลมแบตเตอรี่", "action": "วิธีส่งเคลมแบตเตอรี่" },
        { "label": "เงื่อนไขการรับประกันแบตเตอรี่", "action": "เงื่อนไขการรับประกันแบตเตอรี่" }
      ]
    },
    
    "ซื้อในพื้นที่": {
        
        "response": "คุณลูกค้าเปลี่ยนแบตเตอรี่จากร้านค้าในพื้นที่  สามารถส่งเคลมผ่านทางร้านแบตเตอรี่ที่คุณลูกค้าซื้อมาได้ทันทีครับ"
    },
    "ซื้อนอกพื้นที่":{
        
        "response": "คุณลูกค้าเปลี่ยนแบตเตอรี่จากร้านค้านอกพื้นที่หรือไกลบ้าน  สามารถแจ้งข้อมูลกับเราได้ดังนี้ครับ 1.ชื่อ 2.เบอร์โทร 3.รายละเอียดพื้นที่ที่สะดวกส่งเคลม"
    },
    "ซื้อจากยีเอสพร้อม":{
        "response": "คุณลูกค้าสามารถติดต่อยีเอสพร้อม คอลเซ็นเตอร์ กด 1380 เพื่อแจ้งปัญหาแบตเตอรี่และข้อมูลการเคลมได้เลยครับ",
        "buttons": [
        { "label": "โทร 1380", "action": "โทร 1380", "link": "tel:1380" },
        { "label": "สิ้นสุดเมนู", "action": "สิ้นสุดเมนู" }
      ]
    },
  
    "เงื่อนไขการรับประกันแบตเตอรี่": {
      "response": "เงื่อนไขการรับประกันแบตเตอรี่ของบริษัทฯ มี 2 กรณีดังนี้ครับ",
      "buttons": [
        { "label": "อยู่เงื่อนไข", "action": "อยู่เงื่อนไข" },
        { "label": "ไม่อยู่ในเงื่อนไข", "action": "ไม่อยู่ในเงื่อนไข" },
        { "label": "กลับหน้าเริ่มต้น", "action": "กลับหน้าเริ่มต้น" }
      ]
    },
    "อยู่เงื่อนไข": {
      "response": "AW GS battery warrantee & claim conditons"
    },
    "ไม่อยู่ในเงื่อนไข": {
      "response": "AW GS battery warrantee & claim conditons"
    }
};
